backend/app/controllers/sentences_controller.rb

SELECT "sentences".* FROM "sentences"
---
  def index
    @sentences = Sentence.all

INSERT INTO "sentences" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "sDs"], ["created_at", "2021-04-06 18:35:18.155718"], ["updated_at", "2021-04-06 18:35:18.155718"]]
---
  def create
    @sentence = Sentence.new(sentence_params)

    if @sentence.save

UPDATE "sentences" SET "text" = ?, "updated_at" = ? WHERE "sentences"."id" = ?  [["text", "jhkj"], ["updated_at", "2021-04-07 17:52:39.740149"], ["id", 12]]
---
  def update
    if @sentence.update(sentence_params)

DELETE FROM "sentences" WHERE "sentences"."id" = ?  [["id", 1]]
---
  def destroy
    @sentence.destroy

SELECT "sentences".* FROM "sentences" WHERE "sentences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_sentence
      @sentence = Sentence.find(params[:id])